---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ.BottomFlangeLength
source: html/37c21158-3e55-a913-050e-a035e564118f.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ.BottomFlangeLength Property

Bottom Flange segment length.

## Syntax (C#)
```csharp
public double BottomFlangeLength { get; set; }
```